In [5]:
from sqlalchemy import create_engine
import pandas as pd

# Initial connection to database

In [ ]:

engine = create_engine('postgresql://dukeuser:pgdukeuser@localhost:5432/zoomcampde')
engine.connect()

# Read and prepare data

In [ ]:
green_taxi = pd.read_csv(r'data\green_tripdata_2019-10.csv')
zones = pd.read_csv(r'data\taxi_zone_lookup.csv')
green_taxi.lpep_pickup_datetime	= pd.to_datetime(green_taxi.lpep_pickup_datetime)
green_taxi.lpep_dropoff_datetime = pd.to_datetime(green_taxi.lpep_dropoff_datetime)

# Upload data

In [ ]:
green_taxi.to_sql(name='zones', con=engine, if_exists='append')
zones.to_sql(name='zones', con=engine, if_exists='append')

265

# Answers to questions with SQL query

In [39]:
sql = '''
SELECT
    CASE
        WHEN trip_distance <= 1.0 THEN '1m>' 
        WHEN trip_distance > 1.0 AND trip_distance <= 3.0 THEN '1-3m'
        WHEN trip_distance > 3.0 AND trip_distance <= 7.0 THEN '3-7m'
        WHEN trip_distance > 7.0 AND trip_distance <= 10.0 THEN '7-10m'
        WHEN trip_distance > 10.0 THEN '10m<'
        ELSE 'empty_data'
    END AS miles_group
    ,COUNT(*) AS drives_cnt
FROM public.green_taxi
WHERE
    lpep_pickup_datetime::DATE BETWEEN '2019-10-01' AND '2019-10-31'
    AND lpep_dropoff_datetime::DATE BETWEEN '2019-10-01' AND '2019-10-31'
GROUP BY miles_group
ORDER BY miles_group
'''

pd.read_sql(sql, con=engine)

  miles_group  drives_cnt
0        1-3m      198924
1        10m<       35189
2         1m>      104802
3        3-7m      109603
4       7-10m       27678

  miles_group  drives_cnt
0        1-3m      198924
1        3-7m      109603
2       7-10m       27678
3         <1m      104802
4        >10m       35189